import  { useEffect } from "react";
import BackBtn from '../components/common/BackBtn'

const PrivacyPolicy = () => {
  useEffect(() => {
    window.scrollTo(0, 0);
  }, []);
  return (
    <div className="max-w-3xl relative mx-auto px-4 py-6  animate-fade-left" style={{ direction: "rtl" }}>
               <BackBtn/>
          <h1 className="text-3xl font-bold mb-4">
              سياسة الخصوصية
          </h1>
      <p className="mb-4">
        نحن في <strong className="text-accent">دكــان</strong> نلتزم بحماية
        خصوصيتك وضمان أمان معلوماتك الشخصية. توضح سياسة الخصوصية هذه كيفية جمع
        واستخدام وحماية المعلومات التي تقدمها عند استخدامك لموقعنا المتخصص في
        بيع الهواتف والإلكترونيات.
      </p>

      <h2 className="text-2xl font-semibold mt-6 mb-2">1. جمع المعلومات</h2>
      <p className="mb-4">نجمع المعلومات التالية عند استخدامك لموقعنا:</p>
      <ul className="list-disc list-inside pl-4 mb-4">
        <li>
          معلومات التسجيل: مثل الاسم، عنوان البريد الإلكتروني، وكلمة المرور عند
          إنشاء حساب.
        </li>
        <li>
          معلومات الدفع: مثل تفاصيل بطاقة الائتمان أو معلومات الدفع الأخرى.
        </li>
        <li>
          معلومات الاستخدام: مثل تفاصيل حول كيفية استخدامك لموقعنا والمنتجات
          التي تتصفحها أو تشتريها.
        </li>
      </ul>

      <h2 className="text-2xl font-semibold mt-6 mb-2">2. استخدام المعلومات</h2>
      <p className="mb-4">نستخدم المعلومات التي نجمعها للأغراض التالية:</p>
      <ul className="list-disc list-inside pl-4 mb-4">
        <li>لمعالجة طلبات الشراء وتقديم خدمات العملاء.</li>
        <li>لتحسين تجربة المستخدم من خلال تخصيص المحتوى والعروض.</li>
        <li>
          للتواصل معك بشأن الطلبات والتحديثات والعروض الترويجية (بموافقتك).
        </li>
        <li>لتحليل كيفية استخدام الموقع وتحسين أدائه.</li>
      </ul>

      <h2 className="text-2xl font-semibold mt-6 mb-2">3. حماية المعلومات</h2>
      <p className="mb-4">
        نتخذ تدابير أمنية مناسبة لحماية معلوماتك الشخصية من الوصول غير المصرح به
        أو التعديل أو الكشف أو التدمير. يتم تشفير معلومات الدفع وتخزينها بطريقة
        آمنة.
      </p>

      <h2 className="text-2xl font-semibold mt-6 mb-2">4. مشاركة المعلومات</h2>
      <p className="mb-4">
        نحن لا نشارك معلوماتك الشخصية مع أطراف ثالثة غير الضرورية لتنفيذ الخدمات
        التي نقدمها، مثل شركات معالجة الدفع. قد نشارك معلوماتك إذا طلب منا ذلك
        بموجب القانون أو إذا كان ذلك ضروريًا لحماية حقوقنا القانونية.
      </p>

      <h2 className="text-2xl font-semibold mt-6 mb-2">
        5. ملفات تعريف الارتباط (Cookies)
      </h2>
      <p className="mb-4">
        يستخدم موقعنا ملفات تعريف الارتباط لتحسين تجربتك وتقديم محتوى مخصص.
        يمكنك ضبط إعدادات المتصفح لرفض ملفات تعريف الارتباط، لكن قد يؤثر ذلك على
        وظائف الموقع.
      </p>

      <h2 className="text-2xl font-semibold mt-6 mb-2">
        6. روابط إلى مواقع أخرى
      </h2>
      <p className="mb-4">
        قد يحتوي موقعنا على روابط لمواقع خارجية. نحن غير مسؤولين عن سياسات
        الخصوصية أو الممارسات الخاصة بهذه المواقع.
      </p>

      <h2 className="text-2xl font-semibold mt-6 mb-2">7. حقوقك</h2>
      <p className="mb-4">
        لديك الحق في طلب الوصول إلى معلوماتك الشخصية، تصحيحها، أو حذفها. يمكنك
        أيضًا الانسحاب من تلقي الرسائل التسويقية في أي وقت من خلال اتباع
        التعليمات الواردة في الرسائل.
      </p>

      <h2 className="text-2xl font-semibold mt-6 mb-2">
        8. تغييرات على سياسة الخصوصية
      </h2>
      <p className="mb-4">
        نحتفظ بالحق في تعديل سياسة الخصوصية هذه في أي وقت. سيتم نشر أي تغييرات
        على هذه الصفحة، ويجب عليك مراجعتها بشكل دوري.
      </p>

      <h2 className="text-2xl font-semibold mt-6 mb-2">9. الاتصال بنا</h2>
      <p className="mb-4">
        إذا كان لديك أي أسئلة أو استفسارات بشأن سياسة الخصوصية أو كيفية تعاملنا
        مع معلوماتك الشخصية، يرجى الاتصال بنا عبر [البريد الإلكتروني أو تفاصيل
        الاتصال الأخرى].
      </p>
    </div>
  );
};

export default PrivacyPolicy;